product_db = [(0, {'Наименование': 'Смартфон Apple', 'Цена': '70000', 'Количество': '2', 'ЕИ': 'штука'}),
              (1, {'Наименование': 'Смартфон Samsung', 'Цена': '50000', 'Количество': '2', 'ЕИ': 'штука'}),
              (2, {'Наименование': 'Смартфон Nokia', 'Цена': '30000', 'Количество': '2', 'ЕИ': 'штука'})
              ]
name = 'Цена'
try_add_product = 3
answer = 1
i = 0
while i < try_add_product:
    if answer == 1:
        print(product_db[i][1]['Наименование'])
    if answer == 2:
        print(product_db[i][1]['Цена'])
    if answer == 3:
        print(product_db[i][1]['Количество'])
    i += 1